Config/Documents/КорректировкаРасчетовСУчредителем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаРасчетовСУчредителем</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчредителя</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетАмортизацииОЦИ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлановСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияТипаУчреждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаОборотами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоУчредителя2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоУчредителя3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетаДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеСчетаДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаткаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизацииОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировкиАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПринятогоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВыбывшегоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияПринятогоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияВыбывшегоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/ОборотыРасчетовСУчредителями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыРасчетовСУчредителями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьУвеличение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУменьшение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияУвеличение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияУменьшение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Documents/КорректировкаРасчетовСУчредителем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата, Организация, КорректировкаОборотами");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("ДатаДляОстатков", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	
	ТаблицыЗапроса = Новый Массив;
	Если ДанныеДокумента.КорректировкаОборотами Тогда
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

		ТаблицыЗапроса.Добавить("ОстаткиПоРегистру");
		ТаблицыЗапроса.Добавить("ДанныеДокумента");
		ТаблицыЗапроса.Добавить("ОборотыРасчетовСУчредителями");

		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОборотыРасчетовСУчредителямиОстатки.Организация КАК Организация,
		|	ОборотыРасчетовСУчредителямиОстатки.ИФО КАК ИФО,
		|	ОборотыРасчетовСУчредителямиОстатки.КФО КАК КФО,
		|	ОборотыРасчетовСУчредителямиОстатки.Подразделение КАК Подразделение,
		|	ОборотыРасчетовСУчредителямиОстатки.СтоимостьУвеличениеОстаток КАК СтоимостьУвеличение,
		|	ОборотыРасчетовСУчредителямиОстатки.СтоимостьУменьшениеОстаток КАК СтоимостьУменьшение,
		|	ОборотыРасчетовСУчредителямиОстатки.АмортизацияУвеличениеОстаток КАК АмортизацияУвеличение,
		|	ОборотыРасчетовСУчредителямиОстатки.АмортизацияУменьшениеОстаток КАК АмортизацияУменьшение
		|ПОМЕСТИТЬ ОстаткиПоРегистру
		|ИЗ
		|	РегистрНакопления.ОборотыРасчетовСУчредителями.Остатки(&ДатаДляОстатков, Организация = &Организация) КАК ОборотыРасчетовСУчредителямиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРасчетовСУчредителемОстатки.Ссылка.Организация КАК Организация,
		|	КорректировкаРасчетовСУчредителемОстатки.ИФО КАК ИФО,
		|	КорректировкаРасчетовСУчредителемОстатки.КФО КАК КФО,
		|	КорректировкаРасчетовСУчредителемОстатки.Подразделение КАК Подразделение,
		|	СУММА(КорректировкаРасчетовСУчредителемОстатки.СтоимостьПринятогоОЦИ) КАК СтоимостьПринятогоОЦИ,
		|	СУММА(КорректировкаРасчетовСУчредителемОстатки.СтоимостьВыбывшегоОЦИ) КАК СтоимостьВыбывшегоОЦИ,
		|	СУММА(КорректировкаРасчетовСУчредителемОстатки.АмортизацияПринятогоОЦИ) КАК АмортизацияПринятогоОЦИ,
		|	СУММА(КорректировкаРасчетовСУчредителемОстатки.АмортизацияВыбывшегоОЦИ) КАК АмортизацияВыбывшегоОЦИ
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	Документ.КорректировкаРасчетовСУчредителем.Остатки КАК КорректировкаРасчетовСУчредителемОстатки
		|ГДЕ
		|	КорректировкаРасчетовСУчредителемОстатки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРасчетовСУчредителемОстатки.Ссылка.Организация,
		|	КорректировкаРасчетовСУчредителемОстатки.ИФО,
		|	КорректировкаРасчетовСУчредителемОстатки.КФО,
		|	КорректировкаРасчетовСУчредителемОстатки.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаДокумента КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ОстаткиПоРегистру.Организация КАК Организация,
		|	ОстаткиПоРегистру.ИФО КАК ИФО,
		|	ОстаткиПоРегистру.КФО КАК КФО,
		|	ОстаткиПоРегистру.Подразделение КАК Подразделение,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеДокумента.СтоимостьПринятогоОЦИ <= ОстаткиПоРегистру.СтоимостьУвеличение
		|				ТОГДА ДанныеДокумента.СтоимостьПринятогоОЦИ
		|			ИНАЧЕ ОстаткиПоРегистру.СтоимостьУвеличение
		|		КОНЕЦ) КАК СтоимостьУвеличение,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеДокумента.СтоимостьВыбывшегоОЦИ <= ОстаткиПоРегистру.СтоимостьУменьшение
		|				ТОГДА ДанныеДокумента.СтоимостьВыбывшегоОЦИ
		|			ИНАЧЕ ОстаткиПоРегистру.СтоимостьУменьшение
		|		КОНЕЦ) КАК СтоимостьУменьшение,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеДокумента.АмортизацияПринятогоОЦИ <= ОстаткиПоРегистру.АмортизацияУвеличение
		|				ТОГДА ДанныеДокумента.АмортизацияПринятогоОЦИ
		|			ИНАЧЕ ОстаткиПоРегистру.АмортизацияУвеличение
		|		КОНЕЦ) КАК АмортизацияУвеличение,
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеДокумента.АмортизацияВыбывшегоОЦИ <= ОстаткиПоРегистру.АмортизацияУменьшение
		|				ТОГДА ДанныеДокумента.АмортизацияВыбывшегоОЦИ
		|			ИНАЧЕ ОстаткиПоРегистру.АмортизацияУменьшение
		|		КОНЕЦ) КАК АмортизацияУменьшение
		|ИЗ
		|	ОстаткиПоРегистру КАК ОстаткиПоРегистру
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
		|		ПО ОстаткиПоРегистру.Организация = ДанныеДокумента.Организация
		|			И ОстаткиПоРегистру.ИФО = ДанныеДокумента.ИФО
		|			И ОстаткиПоРегистру.КФО = ДанныеДокумента.КФО
		|			И ОстаткиПоРегистру.Подразделение = ДанныеДокумента.Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоРегистру.Организация,
		|	ОстаткиПоРегистру.ИФО,
		|	ОстаткиПоРегистру.КФО,
		|	ОстаткиПоРегистру.Подразделение
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВЫБОР
		|				КОГДА ДанныеДокумента.СтоимостьПринятогоОЦИ <= ОстаткиПоРегистру.СтоимостьУвеличение
		|					ТОГДА ДанныеДокумента.СтоимостьПринятогоОЦИ
		|				ИНАЧЕ ОстаткиПоРегистру.СтоимостьУвеличение
		|			КОНЕЦ) <> 0
		|		ИЛИ СУММА(ВЫБОР
		|				КОГДА ДанныеДокумента.СтоимостьВыбывшегоОЦИ <= ОстаткиПоРегистру.СтоимостьУменьшение
		|					ТОГДА ДанныеДокумента.СтоимостьВыбывшегоОЦИ
		|				ИНАЧЕ ОстаткиПоРегистру.СтоимостьУменьшение
		|			КОНЕЦ) <> 0
		|		ИЛИ СУММА(ВЫБОР
		|				КОГДА ДанныеДокумента.АмортизацияПринятогоОЦИ <= ОстаткиПоРегистру.АмортизацияУвеличение
		|					ТОГДА ДанныеДокумента.АмортизацияПринятогоОЦИ
		|				ИНАЧЕ ОстаткиПоРегистру.АмортизацияУвеличение
		|			КОНЕЦ) <> 0
		|		ИЛИ СУММА(ВЫБОР
		|				КОГДА ДанныеДокумента.АмортизацияВыбывшегоОЦИ <= ОстаткиПоРегистру.АмортизацияУменьшение
		|					ТОГДА ДанныеДокумента.АмортизацияВыбывшегоОЦИ
		|				ИНАЧЕ ОстаткиПоРегистру.АмортизацияУменьшение
		|			КОНЕЦ) <> 0)";

	Иначе	
		ТаблицыЗапроса.Добавить("ОборотыРасчетовСУчредителями");
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаДокумента КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ОборотыРасчетовСУчредителямиОстатки.Организация КАК Организация,
		|	ОборотыРасчетовСУчредителямиОстатки.ИФО КАК ИФО,
		|	ОборотыРасчетовСУчредителямиОстатки.КФО КАК КФО,
		|	ОборотыРасчетовСУчредителямиОстатки.Подразделение КАК Подразделение,
		|	ОборотыРасчетовСУчредителямиОстатки.СтоимостьУвеличениеОстаток КАК СтоимостьУвеличение,
		|	ОборотыРасчетовСУчредителямиОстатки.СтоимостьУменьшениеОстаток КАК СтоимостьУменьшение,
		|	ОборотыРасчетовСУчредителямиОстатки.АмортизацияУвеличениеОстаток КАК АмортизацияУвеличение,
		|	ОборотыРасчетовСУчредителямиОстатки.АмортизацияУменьшениеОстаток КАК АмортизацияУменьшение
		|ИЗ
		|	РегистрНакопления.ОборотыРасчетовСУчредителями.Остатки(&ДатаДляОстатков, Организация = &Организация) КАК ОборотыРасчетовСУчредителямиОстатки";
	КонецЕсли;	

	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
